"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict
"""

seasons = ["Зима", "Весна", "Лето", "Осень"]
user_mth = int(input("Введите месяц года числом >>> "))

# 1й вариант

if 3 <= user_mth <= 5:
    print("Сезон >>> ", seasons[1])
elif 6 <= user_mth <= 8:
    print("Сезон >>> ", seasons[2])
elif 9 <= user_mth <= 11:
    print("Сезон >>> ", seasons[3])
else:
    print("Сезон >>> ", seasons[0])

# 2й вариант

d_seasons = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето",
             7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

print("Сезон >>> ", d_seasons.get(user_mth))

