"""
Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел, то вначале нужно добавить
сумму этих чисел к полученной ранее сумме и после этого завершить программу.
"""

symb = input("Введите специальный символ для завершения >>> ")
sum = 0

while True:
    for el in input("Введите строку чисел, разделенных пробелом >>> ").split():
        if el == symb:
            print(sum)
        else:
            sum = sum + int(el)


